<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,160,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/model.16/Constant_9" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 2940" offset="0" size="23520" />
			<output>
				<port id="0" precision="FP32" names="/model.16/Constant_9_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2940</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_665" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="23520" size="1728" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_665">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/model.0/model/conv_stem/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_182" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="25248" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model.0/model/conv_stem/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/conv_stem/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model.0/model/act1/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/act1/HardSwish_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_192" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="25312" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model.0/model/blocks.0/blocks.0.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_242" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="25888" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model.0/model/blocks.0/blocks.0.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/model.0/model/blocks.0/blocks.0.0/bn1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/bn1/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_245" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="25952" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model.0/model/blocks.0/blocks.0.0/se/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/ReduceMean_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model.0.model.blocks.0.0.se.conv_reduce.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="25968" size="512" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.0.0.se.conv_reduce.weight">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model.0/model/blocks.0/blocks.0.0/se/conv_reduce/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_258" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="26480" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/model.0/model/blocks.0/blocks.0.0/se/conv_reduce/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/conv_reduce/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model.0/model/blocks.0/blocks.0.0/se/act1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/act1/Relu_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model.0.model.blocks.0.0.se.conv_expand.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 1" offset="26512" size="512" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.0.0.se.conv_expand.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/model.0/model/blocks.0/blocks.0.0/se/conv_expand/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_272" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="27024" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model.0/model/blocks.0/blocks.0.0/se/conv_expand/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/conv_expand/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_274" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="27088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="Constant_275" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="27092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="25" name="/model.0/model/blocks.0/blocks.0.0/se/gate/HardSigmoid" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/gate/HardSigmoid_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model.0/model/blocks.0/blocks.0.0/se/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/se/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::Conv_671" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="27096" size="512" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_671">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model.0/model/blocks.0/blocks.0.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_289" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="27608" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model.0/model/blocks.0/blocks.0.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.0/blocks.0.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Conv_674" type="Const" version="opset1">
			<data element_type="f32" shape="40, 8, 1, 1" offset="27640" size="1280" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_674">
					<dim>40</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model.0/model/blocks.1/blocks.1.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_302" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="28920" size="160" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model.0/model/blocks.1/blocks.1.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model.0/model/blocks.1/blocks.1.0/bn1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.1/blocks.1.0/bn1/act/Relu_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_312" type="Const" version="opset1">
			<data element_type="f32" shape="40, 1, 1, 3, 3" offset="29080" size="1440" />
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model.0/model/blocks.1/blocks.1.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_362" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="30520" size="160" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model.0/model/blocks.1/blocks.1.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/model.0/model/blocks.1/blocks.1.0/bn2/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.1/blocks.1.0/bn2/act/Relu_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_680" type="Const" version="opset1">
			<data element_type="f32" shape="16, 40, 1, 1" offset="30680" size="2560" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_680">
					<dim>16</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model.0/model/blocks.1/blocks.1.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_376" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="33240" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model.0/model/blocks.1/blocks.1.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::Conv_683" type="Const" version="opset1">
			<data element_type="f32" shape="56, 16, 1, 1" offset="33304" size="3584" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_683">
					<dim>56</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model.0/model/blocks.1/blocks.1.1/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_389" type="Const" version="opset1">
			<data element_type="f32" shape="1, 56, 1, 1" offset="36888" size="224" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model.0/model/blocks.1/blocks.1.1/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model.0/model/blocks.1/blocks.1.1/bn1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/bn1/act/Relu_output_0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_399" type="Const" version="opset1">
			<data element_type="f32" shape="56, 1, 1, 3, 3" offset="37112" size="2016" />
			<output>
				<port id="0" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model.0/model/blocks.1/blocks.1.1/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_449" type="Const" version="opset1">
			<data element_type="f32" shape="1, 56, 1, 1" offset="39128" size="224" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model.0/model/blocks.1/blocks.1.1/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model.0/model/blocks.1/blocks.1.1/bn2/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/bn2/act/Relu_output_0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="onnx::Conv_689" type="Const" version="opset1">
			<data element_type="f32" shape="16, 56, 1, 1" offset="39352" size="3584" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_689">
					<dim>16</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model.0/model/blocks.1/blocks.1.1/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_463" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="42936" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model.0/model/blocks.1/blocks.1.1/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model.0/model/blocks.1/blocks.1.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.1/blocks.1.1/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx::Conv_692" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="43000" size="4096" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_692">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model.0/model/blocks.2/blocks.2.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_477" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="47096" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model.0/model/blocks.2/blocks.2.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model.0/model/blocks.2/blocks.2.0/bn1/act/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/bn1/act/HardSwish_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_487" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 5, 5" offset="47352" size="6400" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model.0/model/blocks.2/blocks.2.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_537" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="53752" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model.0/model/blocks.2/blocks.2.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model.0/model/blocks.2/blocks.2.0/bn2/act/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/bn2/act/HardSwish_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_540" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="25952" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model.0/model/blocks.2/blocks.2.0/se/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/ReduceMean_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model.0.model.blocks.2.0.se.conv_reduce.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 64, 1, 1" offset="54008" size="4096" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.2.0.se.conv_reduce.weight">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model.0/model/blocks.2/blocks.2.0/se/conv_reduce/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_553" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="58104" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model.0/model/blocks.2/blocks.2.0/se/conv_reduce/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/conv_reduce/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model.0/model/blocks.2/blocks.2.0/se/act1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/act1/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model.0.model.blocks.2.0.se.conv_expand.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="58168" size="4096" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.2.0.se.conv_expand.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model.0/model/blocks.2/blocks.2.0/se/conv_expand/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_567" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="62264" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model.0/model/blocks.2/blocks.2.0/se/conv_expand/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/conv_expand/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_569" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="27088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="Constant_570" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="27092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="/model.0/model/blocks.2/blocks.2.0/se/gate/HardSigmoid" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/gate/HardSigmoid_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model.0/model/blocks.2/blocks.2.0/se/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/se/Mul_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="onnx::Conv_698" type="Const" version="opset1">
			<data element_type="f32" shape="24, 64, 1, 1" offset="62520" size="6144" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_698">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model.0/model/blocks.2/blocks.2.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_584" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="68664" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model.0/model/blocks.2/blocks.2.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="onnx::Conv_701" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="68760" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_701">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model.0/model/blocks.2/blocks.2.1/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_597" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="82584" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/model.0/model/blocks.2/blocks.2.1/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model.0/model/blocks.2/blocks.2.1/bn1/act/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/bn1/act/HardSwish_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_607" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 5, 5" offset="83160" size="14400" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model.0/model/blocks.2/blocks.2.1/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_657" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="97560" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/model.0/model/blocks.2/blocks.2.1/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model.0/model/blocks.2/blocks.2.1/bn2/act/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/bn2/act/HardSwish_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_660" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="25952" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model.0/model/blocks.2/blocks.2.1/se/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>10</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/se/ReduceMean_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model.0.model.blocks.2.1.se.conv_reduce.weight" type="Const" version="opset1">
			<data element_type="f32" shape="40, 144, 1, 1" offset="98136" size="23040" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.2.1.se.conv_reduce.weight">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model.0/model/blocks.2/blocks.2.1/se/conv_reduce/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Reshape_673" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="121176" size="160" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model.0/model/blocks.2/blocks.2.1/se/conv_reduce/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/se/conv_reduce/Conv_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model.0/model/blocks.2/blocks.2.1/se/act1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/model/blocks.2/blocks.2.1/se/act1/Relu_output_0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model.0.model.blocks.2.1.se.conv_expand.weight" type="Const" version="opset1">
			<data element_type="f32" shape="144, 40, 1, 1" offset="121336" size="23040" />
			<output>
				<port id="0" precision="FP32" names="model.0.model.blocks.2.1.se.conv_expand.weight">
					<dim>144</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model.0/model/blocks.2/blocks.2.1/se/conv_expand/Conv/WithoutBiases" type="Convolution" version="opset1">
